## Посчитать пропущенные значения
Subtract the count of the non-NULL ticker values from the total number of rows; alias the difference as missing.

In [ ]:
SELECT COUNT(*) - COUNT(ticker) AS missing
  FROM fortune500;

In [ ]:
WHERE
    IncidentState IS NOT NULL

## Imputing missing values
Write a T-SQL query which only returns rows where IncidentState is missing.
Replace all the missing values in the IncidentState column with the values in the City column and name this new column Location.

In [ ]:
SELECT IncidentState, ISNULL(IncidentState, City) AS Location
FROM Incidents
WHERE IncidentState IS NULL

What if you want to replace missing values in one column with another and want to check the replacement column to make sure it doesn't have any missing values? To do that you need to use the COALESCE statement.

SELECT Shape, City, COALESCE(Shape, City, 'Unknown') as NewShape
FROM Incidents

+----------------+-----------+-------------+
| Shape          |  City     |  NewShape   |
+----------------+-----------+-------------+
| NULL           | Orb       | Orb         |
| Triangle       | Toledo    | Triangle    |
| NULL           | NULL      | Unknown     | 
+----------------+-----------+-------------+

Suppose you want to calculate the number of years between two different dates, DateOne and DateTwo. Which SQL statement would you use to perform that calculation?

SELECT DATEDIFF(YYYY, DateOne, DateTwo)

-- Return the DeliveryDate as 5 days after the ShipDate
SELECT OrderDate, 
       DATEADD(DD, 5, ShipDate) AS DeliveryDate
FROM Shipments

SELECT a.RecordId, a.Age, a.BloodGlucoseRandom, 
-- Maximum Glucose value from the derived table        
       b.MaxGlucose
FROM Kidney a
-- Derived table
JOIN (SELECT Age, MAX(BloodGlucoseRandom) AS MaxGlucose FROM Kidney GROUP BY Age) b
-- Join on Age
ON a.AGE = b.AGE

RecordId	Age	BloodGlucoseRandom	MaxGlucose
29	0	93	220
71	0	129	220
109	0	0	220
29	0	104	220
113	0	219	220
29	0	220	220
178	0	110	220
190	0	207	220
251	0	100	220
201	2	0	0
174	3	0	0
172	4	99	99

In this exercise, you will use a CTE to return all the ages with the maximum BloodGlucoseRandom in the table.

-- Create the CTE
WITH BloodGlucoseRandom (MaxGlucose) 
AS (SELECT MAX(BloodGlucoseRandom) AS MaxGlucose FROM Kidney)

SELECT a.Age, b.MaxGlucose
FROM Kidney a
-- Join the CTE  
JOIN BloodGlucoseRandom b
ON b.MaxGlucose = a.BloodGlucoseRandom

## Биннинг в SQL

Техника основывается на использовании операторов больше-меньше в JOIN.
* https://mode.com/sql-tutorial/sql-join-comparison-operators/

-- Bins created in previous step
WITH bins AS (
      SELECT generate_series(2200, 3050, 50) AS lower,
             generate_series(2250, 3100, 50) AS upper),
     -- subset stackoverflow to just tag dropbox
     dropbox AS (
      SELECT question_count 
        FROM stackoverflow
       WHERE tag='dropbox') 
-- select lower, upper, and count(*)
SELECT lower, upper, COUNT(*)
  -- from bins created above
  FROM bins
       -- join to dropbox and keep all rows from bins
       LEFT JOIN dropbox
       -- Compare question_count to lower and upper
         ON question_count >= lower 
        AND question_count < upper
 -- Group by lower and upper to count values in each bin
 GROUP BY lower, upper
 -- Order by lower to put bins in order
 ORDER BY lower;

## Оконные функции
https://mode.com/sql-tutorial/sql-window-functions/

## Мода

In [ ]:
-- CTE from the previous exercise
WITH ModePrice (OrderPrice, UnitPriceFrequency)
AS
(
	SELECT OrderPrice,
	ROW_NUMBER() 
    OVER (PARTITION BY OrderPrice ORDER BY OrderPrice) AS UnitPriceFrequency
	FROM Orders
)

-- Calculate the mode
SELECT OrderPrice AS Mode
FROM ModePrice
-- The WHERE clause should only return the maximum value of UnitPriceFrequency
WHERE UnitPriceFrequency IN (SELECT MAX(UnitPriceFrequency) FROM ModePrice)

## Медиана

* http://www.dba-oracle.com/t_sql_within_group.htm
* http://leafo.net/guides/postgresql-calculating-percentile.html

-- What groups are you computing statistics by?
SELECT sector,
       -- Select the mean of assets with the avg function
       AVG(assets) AS mean,
       -- Select the median
       PERCENTILE_DISC(0.5) WITHIN GROUP (ORDER BY assets) AS median
  FROM fortune500
 -- Computing statistics for each what?
 GROUP BY sector
 -- Order results by a value of interest
 ORDER BY median;